# Задача 6
# Напишите код, который переводит целое число в строку, при том что его можно применить в любой системе счисления.

x=5
y=10
z=x+y

print("{0} in binary {0:0b}   in hex {0:02x} in octal {0:02o}".format(z))